#+title: Lists in R - Lab exercises
#+AUTHOR: [yourname] (pledged)
#+SUBTITLE: Introduction to data science (DSC 105) Fall 2024
#+STARTUP: overview hideblocks indent inlineimages
#+PROPERTY: header-args:R :session *R* :exports both :results output
* Practice creating, naming, slicing, changing lists

1) Create a /named/ =list= called "List" of the following members:
   - A =numeric= vector consisting of the whole numbers 1
     to 10.
   - A =logical= 3x3 identity matrix - use =diag=, =as.logical=,
     and =matrix= to build it (=diag(3)= is a 3x3 identity matrix).
   - A =character= vector, whose elements are the names Matthew, Mark,
     Luke, and John.

   #+begin_src R

   #+end_src

2) Print =List= and the structure of =List=.

   #+begin_src R

   #+end_src

3) Name the list members ="one to ten"=, ="identity"=, and ="evangelists"=
   using =names=. Print the =names= of =List=.

   #+begin_src R

   #+end_src

4) Print the list structure again.

   #+begin_src R

   #+end_src

   You should get this result:
   #+begin_example
   : List of 3
   :  $ one to ten : int [1:10] 1 2 3 4 5 6 7 8 9 10
   :  $ identity   : logi [1:3, 1:3] TRUE FALSE FALSE FALSE TRUE FALSE ...
   :  $ evangelists: chr [1:4] "Matthew" "Mark" "Luke" "John"
   #+end_example

5) Remove last row of the matrix member and store the resulting list
   in =List2=. Print the structure of =List2= to confirm. In the correct
   result, the =identity= member should have the dimension 2 x 3
   (=logi[1:2,1:3]=)..

   - Tip: You can simply overwrite any list member with a new
     value. Before doing that, test your code after making a copy of
     the list!

   - Test with copy:
     #+begin_src R
       L <- List
       str(L)
       L$identity[-3,]
       L$identity <- L$identity[-3,]
       str(L)
     #+end_src

     #+RESULTS:
     #+begin_example
     List of 3
      $ one to ten : int [1:10] 1 2 3 4 5 6 7 8 9 10
      $ identity   : logi [1:3, 1:3] TRUE FALSE FALSE FALSE TRUE FALSE ...
      $ evangelists: chr [1:4] "Matthew" "Mark" "Luke" "John"
     [,1]  [,2]  [,3]
     [1,]  TRUE FALSE FALSE
     [2,] FALSE  TRUE FALSE
     List of 3
      $ one to ten : int [1:10] 1 2 3 4 5 6 7 8 9 10
      $ identity   : logi [1:2, 1:3] TRUE FALSE FALSE TRUE FALSE FALSE
      $ evangelists: chr [1:4] "Matthew" "Mark" "Luke" "John"
     #+end_example

   - Looks good, so do it with the original:
     #+begin_src R
       List$identity <- List$identity[-3,]
       str(List)
     #+end_src

     You should get this result:
     #+begin_example
     : List of 3
     :  $ one to ten : int [1:10] 1 2 3 4 5 6 7 8 9 10
     :  $ identity   : logi [1:2, 1:3] TRUE FALSE FALSE TRUE FALSE FALSE
     :  $ evangelists: chr [1:4] "Matthew" "Mark" "Luke" "John"
     #+end_example

6) Create an ordered =factor= called =price= with the elements: cheap,
   pricy, cheap, cheap, pricy, where "cheap" is below "pricy".

   Tip: The parameter to order a factor is called =ordered=, and the
   parameter to order its levels is called =levels=.

   #+begin_src R
     ## build the factor

     ## order the factor and save it

     ## print factor
   #+end_src

7) Add the factor =price= to the end of =List2=. Remember to make a copy
   of list before altering it for good!

   #+begin_src R

   #+end_src

   You should get this result:
   #+begin_example
   : List of 4
   :  $ one to ten : int [1:10] 1 2 3 4 5 6 7 8 9 10
   :  $ identity   : logi [1:2, 1:3] TRUE FALSE FALSE TRUE FALSE FALSE
   :  $ evangelists: chr [1:4] "Matthew" "Mark" "Luke" "John"
   :  $ price      : Ord.factor w/ 2 levels "cheap"<"pricy": 1 2 1 1 2
   #+end_example


8) Remove the last element of the =factor= member in =List2= using the
   =length= function, and save the result to =price2=.

   #+begin_src R
     ## store last member index

     ## show last member

     ## remove last element from last member and save it

     ## print result
   #+end_src

9) Replace the =price= factor by the new one, =price2=, and update =List2=
   to =List3=.

   - Tip: To remove member N from a list L, use =L[-N]=.

     #+begin_src R

     #+end_src

10) Transpose the matrix =identity= using the =t= function and save the
    resulting matrix in a new list =List4= in the second position as
    before.

    Transposition:
    #+begin_src R
      ## transpose matrix and save it

    #+end_src

    Make copy of list and replace matrix member:
    #+begin_src R
      ## Copy list into new list and check structure

      ## Replace 2nd element and check new structure

    #+end_src

    
    You should get this output for before/after:
    #+begin_example
    List of 4
     $ one to ten : int [1:10] 1 2 3 4 5 6 7 8 9 10
     $ identity   : logi [1:2, 1:3] TRUE FALSE FALSE TRUE FALSE FALSE
     $ evangelists: chr [1:4] "Matthew" "Mark" "Luke" "John"
     $ price      : Ord.factor w/ 2 levels "cheap"<"pricy": 2 1 1 2
    List of 4
     $ one to ten : int [1:10] 1 2 3 4 5 6 7 8 9 10
     $ identity   : logi [1:3, 1:2] TRUE FALSE FALSE FALSE TRUE FALSE
     $ evangelists: chr [1:4] "Matthew" "Mark" "Luke" "John"
     $ price      : Ord.factor w/ 2 levels "cheap"<"pricy": 2 1 1 2
    #+end_example

    Your final result should look like this:

    #+begin_src R
      List4
    #+end_src

    #+RESULTS:
    #+begin_example
    $`one to ten`
     [1]  1  2  3  4  5  6  7  8  9 10

    $identity
          [,1]  [,2]
    [1,]  TRUE FALSE
    [2,] FALSE  TRUE
    [3,] FALSE FALSE

    $evangelists
    [1] "Matthew" "Mark"    "Luke"    "John"

    $price
    [1] pricy cheap cheap pricy
    Levels: cheap < pricy
    #+end_example
